// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
int numPalindrome = SetNumber("Palindrome");
bool isPalindrome = IsPalindromeInt(numPalindrome);
string str = isPalindrome ? "является палиндромом" : "не является палиндромом";
if (isPalindrome);
{
    string str = "является палиндромом";
}
else
{
    string str = "не является палиндромом";
}
System.Console.WriteLine($"число {numPalindrome} {str}");